Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__xiaoya-nanyoujiayu-002__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 南山有臺，北山有萊。樂只君子，邦家之基。樂只君子，萬壽無期。
en: On the hills of the south is the Tai plant, On those of the north is the Lai. To be rejoiced in are ye, noble men, The foundations of the State. To be rejoiced in are ye, noble men; -- May your years be myriads and without end!

source: 南山有桑，北山有楊。樂只君子，邦家之光。樂只君子，萬壽無疆。
en: On the hills of the south are the mulberry trees, On those of the north are willows. To be rejoiced in are ye, noble men, The light of the State. To be rejoiced in are ye, noble men; -- May your years be myriads, unlimited!

source: 南山有杞，北山有李。樂只君子，民之父母。樂只君子，德音不已。
en: On the hills of the south are medlars; On those of the north are plum trees. To be rejoiced in are ye, noble men, Parents of the people. To be rejoiced in are ye, noble men; -- May your virtuous fame have no end!

source: 南山有栲，北山有杻。樂只君子，遐不眉壽。樂只君子，德音是茂。
en: On the hills of the south is the Kao; On those of the north is the Niu. To be rejoiced in are ye, noble men, Have ye not the eyebrows of longevity? To be rejoiced in are ye, noble men; -- May your virtuous fame be abundant!

source: 南山有枸，北山有楰。樂只君子，遐不黃耇。樂只君子，保艾爾後。
en: On the hills of the south is the Ju; On those of the north is the Yu. To be rejoiced in are ye, gentlemen; -- Will ye not have the grey hair and wrinkled face? To be rejoiced in are ye, gentlemen; -- May ye preserve and maintain your posterity!
